demo-blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "King"], ["content", "King "], ["created_at", "2021-02-06 10:30:17.853721"], ["updated_at", "2021-02-06 10:30:17.853721"]]
---
  def create
    @post = Post.new(posts_params)
    if @post.save